{
  "Student ID Card": "To obtain a student ID card, go to the Student Affairs Office. Required documents: enrollment certificate, copy of National ID, one passport-sized photo. Fill out the ID request form. Processing takes 2–3 business days. Collect the card in person.",

  "Enrollment Certificate": "To request an enrollment certificate, visit the Registrar's Office. Required documents: valid student ID, completed request form. The certificate is issued in 1–2 business days, either via email or in person.",

  "Academic Transcript": "To get an academic transcript, go to the Registrar's Office. Required documents: student ID, transcript request form, and payment receipt if applicable. Processing time is 3–5 business days. Transcripts are provided by mail or in person.",

  "Dormitory Housing": "To apply for dormitory housing, submit your application to the Housing Office. Required documents: enrollment certificate, copy of National ID, passport-sized photo, housing application form. Results are announced in 5–10 business days via email or posted notice.",

  "Cafeteria Card": "To receive a cafeteria card, go to the Student Services Office. Required documents: student ID, one passport-sized photo, filled-out cafeteria application form. Processing takes 2 business days.",

  "Internship Authorization Letter": "To get authorization for an internship, visit the Internships Office. Required documents: student ID, internship acceptance letter, internship request form. Letter issued in 3 business days via email or in person.",

  "Degree Certificate": "To collect your degree certificate after graduation, go to the Registrar's Office. Required documents: student ID, completed request form, clearance form (confirms all dues are cleared). Processing takes 10–15 business days.",

  "Re-Issuance of Lost Student Card": "To replace a lost student card, go to the Student Affairs Office. Required documents: police declaration of loss, one passport-sized photo, copy of National ID, and replacement fee receipt. New card is issued in 3 days.",

  "Student Insurance Registration": "To register for student insurance, go to the Insurance Desk. Required documents: student ID, insurance registration form, passport photo, and copy of National ID. Insurance proof issued in 5 days.",

  "Library Card Registration": "To obtain a library card, go to the university library. Required documents: valid student ID, passport-sized photo, and library registration form. Card is issued immediately.",

  "Change of Major or Program": "To change your major or academic program, consult your academic advisor and submit your request to the Dean’s Office. Required documents: written request, academic transcript, and student ID. Decision given within 7–10 business days.",

  "Leave of Absence Request": "To request a leave of absence, go to the Registrar's Office. Required documents: filled-out leave request form, supporting documents (e.g., medical certificate), and student ID. Processed within 5 business days.",

  "Scholarship Request": "To apply for a scholarship, go to the Financial Aid Office. Required documents: scholarship application form, proof of family income, recent academic transcripts, and student ID. Processing takes 2–4 weeks.",

  "Student Visa Renewal (International Students)": "To renew your visa, visit the International Students Office. Required documents: passport, copy of current visa, proof of enrollment, proof of financial means, housing certificate. Processing takes 15–30 days.",

  "Official Letter for Embassy": "To request an official university letter (e.g., for embassy), visit the Registrar's Office. Required documents: student ID, request form, reason for the letter. Processing takes 2–3 business days."
}

